src/Documents/Scan_ЗаявкаПеревозчику/Scan_ЗаявкаПеревозчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаПеревозчику</name>
  <basedOn>Document.Scan_ЗаявкаПеревозчику</basedOn>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <registerRecords>InformationRegister.Scan_РеестрОказанныхУслуг</registerRecords>
  <registerRecords>AccumulationRegister.Scan_МестонахождениеИзделий</registerRecords>
  <registerRecords>AccumulationRegister.Scan_ЗаявкиНаДействия</registerRecords>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПеревозчиком</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиИзделий</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпанияОтправитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпанияПолучатель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденаПеревозчиком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУходаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеКорректировки</name>
    <comment>служебный реквизит</comment>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОказанныхУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактыОтправителя</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателя</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>ЗаявкаНаДействие</name>
      <type>
        <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
        <types>CatalogRef.Scan_Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУходаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарииТК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
        <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Scan_НоменклатураУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.Scan_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗаявкаПеревозчику/Forms/ФормаНастроекПечатиДетализированногоАкта/Module.bsl
// Rarus tenkam 28.06.2022 mantis 18726 АПК + (Стандартные области)
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаявкаПеревозчику = Параметры.ЗаявкаПеревозчику;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("П1", ЗаявкаПеревозчику);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие КАК Продукт,
	|	ИСТИНА КАК Печатать
	|ИЗ
	|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
	|ГДЕ
	|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка = &П1";
	РезультатЗапроса = Запрос.Выполнить();
	
	Продукты.Загрузить(РезультатЗапроса.Выгрузить());
	
	ЗаполнятьКонтрагентов = Истина;
	
	ПроверитьНаличиеСпецификацииSPII();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаПродукта Из Продукты Цикл
		СтрокаПродукта.Печатать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаПродукта Из Продукты Цикл
		СтрокаПродукта.Печатать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	НайденныеСтроки = Продукты.НайтиСтроки(Новый Структура("Печатать", Истина));
	Если НайденныеСтроки.Количество() > 0 Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ЗаявкаПеревозчику);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ЗаявкаПеревозчику",        //Менеджер печати
																	"ПФ_MXL_ДетализированныйАкт",//Идентификатор
																	МассивОбъектов,              //Объекты печати
																	ЭтотОбъект,                  //Владелец формы - форма из которой вызывается печать
																	ПолучитьПараметрыПечати());  //Параметры печати - произвольные параметры для передачи в менеджер печати
		Закрыть();
	Иначе
		Сообщить(НСтр("ru='Не удалось сформировать детализированный акт - не выбран ни один продукт'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	МассивПродуктов = Новый Массив;
	
	НайденныеСтроки = Продукты.НайтиСтроки(Новый Структура("Печатать", Истина));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивПродуктов.Добавить(НайденнаяСтрока.Продукт);
	КонецЦикла;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("МассивПродуктов", МассивПродуктов);
	ПараметрыПечати.Вставить("ЗаполнятьКонтрагентов", ЗаполнятьКонтрагентов);
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеСпецификацииSPII()
	
	МассивПродуктов = Новый Массив;
	
	НайденныеСтроки = Продукты.НайтиСтроки(Новый Структура("Печатать", Истина));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивПродуктов.Добавить(НайденнаяСтрока.Продукт);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("П1", МассивПродуктов);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_Изделия.Ссылка КАК Продукт,
	|	Scan_Изделия.СпецификацияПродукта КАК СпецификацияПродукта
	|ПОМЕСТИТЬ ВТ_СпецификацияПродукта
	|ИЗ
	|	Справочник.Scan_Изделия КАК Scan_Изделия
	|ГДЕ
	|	Scan_Изделия.Ссылка В(&П1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СпецификацияПродукта.Продукт КАК Продукт,
	|	ВТ_СпецификацияПродукта.СпецификацияПродукта КАК СпецификацияПродукта
	|ИЗ
	|	ВТ_СпецификацияПродукта КАК ВТ_СпецификацияПродукта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_ВерсииБазовыхСпецификаций КАК Scan_ВерсииБазовыхСпецификаций
	|		ПО ВТ_СпецификацияПродукта.СпецификацияПродукта = Scan_ВерсииБазовыхСпецификаций.Владелец
	|			И (НЕ Scan_ВерсииБазовыхСпецификаций.ПометкаУдаления)
	|			И (Scan_ВерсииБазовыхСпецификаций.ВидСпецификации = ЗНАЧЕНИЕ(Справочник.Scan_ВидыСпецификацийПродуктов.SPIIСпецификация))
	|ГДЕ
	|	Scan_ВерсииБазовыхСпецификаций.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить(СтрШаблон(НСтр("ru='Обратите внимание, по продукту %1 спецификация SPII отсутствует!'"), Выборка.Продукт));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
